Tutorials/interTwoPhase_for_the_article/Gas_500/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho1|rho2|volumeFraction1|U|T|p_rgh).*"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-9;
        relTol          0.0;
        cAlpha          1.0;
        nAlphaCorr      1;
    }

    "(pcorr).*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner GAMG;
            smoother       DIC;
            relTol         1e-3;
            tolerance      1e-5;
        }
        tolerance       1e-9;
        relTol          0.0;
    }
}

PIMPLE
{
    nOuterCorrectors                 3;
    nCorrectors                      1;
    pcorrRefCell                     1;
    pcorrRefValue                  0.0;
    #includeIfPresent "PIMPLEsettings";
}

// ************************************************************************* //
