Tutorials/interTwoPhase_for_the_article/Gas_500/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

touch sodPCF.foam

runApplication blockMesh

restore0Dir

runApplication setFields
runApplication $(getApplication)


#------------------------------------------------------------------------------
